Revit 2027 API
ExternallyTaggedBRep.GetTaggedGeometry Method
 Returns the externally tagged geometry object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public GeometryObject GetTaggedGeometry(
	ExternalGeometryId externalId
)
Public Function GetTaggedGeometry (
	externalId As ExternalGeometryId
) As GeometryObject
public:
GeometryObject^ GetTaggedGeometry(
	ExternalGeometryId^ externalId
)
member GetTaggedGeometry :
        externalId : ExternalGeometryId -> GeometryObject
Parameters
externalId ExternalGeometryId
 An external tag that may match a geometry object (i.e face/edge) in this Solid.
Return Value
GeometryObject
 Returns the geometry object that matches the external tag. If no such object is found, this method will return null.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExternallyTaggedBRep Class
Autodesk.Revit.DB Namespace